org/sitemap.org
* Latest Posts

   #+INCLUDE: "./posts/senate-covid-relief-minimum-wage.org::*How to solve Congress's minimum wage dilemma" :lines 2-3
  #+INCLUDE: "../content/senate-covid-relief-minimum-wage.org" :lines 1-6  
 [[./posts/senate-covid-relief-minimum-wage.org][Read more...]] \\
   [[./tags/politics.org][politics]]


** [[./posts/impeachment-clarifies-gop-position.org][What the Latest Impeachment Trial Says about the Current State of US Politics]]
   **02/27/21 Sat** \\
On the weekend before Last, the US Senate concluded the second impeachment trial of former president Donald Trump, who had been impeached for inciting the insurrection at the US Capitol on January 6..
   [[./posts/impeachment-clarifies-gop-position.org][Read more...]] \\
   [[./tags/politics.org][politics]]

** [[./posts/blog-org-mode-pt-2.org][Blogging with Org Mode: An Update]]
  **Saturday, August 22, 2020** \\
In my [[./posts/blogging-with-org-mode.org][last post]], I went over how I set up this blog solely in org-mode. And since that post has been published, I've made a few more changes to the configuration and so, in an effort to provide the most up to date information, I figured I'd write a little addendum.
  [[./posts/blog-org-mode-pt-2.org][Read more...]]\\
  [[./tags/dev.org][dev]]

** [[./posts/blogging-with-org-mode.org][How I built a simple static blog with org-mode]] || 08/11/20 Tue 
   /[[./tags/dev.org][dev]]/
   There's always something new to discover with emacs and org-mode, and building a blog was my way of wading into deeper waters - not longer content to just get my feet wet. 
   [[./posts/blogging-with-org-mode.org][Read more...]]\\
