docs/sitemap.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-03-04 Thu 20:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>How to solve Congress's minimum wage dilemma</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Megan Durham">
<link rel="stylesheet" type="text/css" href="../css/style.css"></head>
<body>
<div id="content">
<div id="outline-container-org6b647f1" class="outline-2">
<h2 id="org6b647f1">Latest Posts</h2>
<div class="outline-text-2" id="text-org6b647f1">
</div>
<div id="outline-container-org6d32f48" class="outline-3">
<h3 id="org6d32f48"><a href="./posts/senate-covid-relief-minimum-wage.html">How to solve Congress's minimum wage dilemma</a></h3>
<div class="outline-text-3" id="text-org6d32f48">
<p>
#+BEGIN<sub>lines</sub>
</p>
</div>
</div>
</div>

<div id="outline-container-org44b7e3d" class="outline-2">
<h2 id="org44b7e3d">How to solve Congress's minimum wage dilemma</h2>
<div class="outline-text-2" id="text-org44b7e3d">
<p>
<b><b>Thursday, March 04, 2021</b></b>
</p>

<p>
<i>Tagged: <a href="../tags/politics.html">politics</a></i>
</p>


<p>
#+END<sub>lines</sub>
<a href="./posts/senate-covid-relief-minimum-wage.html">Read more&#x2026;</a>
<a href="./tags/politics.html">politics</a>
</p>
</div>


<div id="outline-container-orge0d89af" class="outline-3">
<h3 id="orge0d89af"><a href="./posts/impeachment-clarifies-gop-position.html">What the Latest Impeachment Trial Says about the Current State of US Politics</a></h3>
<div class="outline-text-3" id="text-orge0d89af">
<p>
   <b><b>02/27/21 Sat</b></b> <br>
On the weekend before Last, the US Senate concluded the second impeachment trial of former president Donald Trump, who had been impeached for inciting the insurrection at the US Capitol on January 6..
   <a href="./posts/impeachment-clarifies-gop-position.html">Read more&#x2026;</a> <br>
   <a href="./tags/politics.html">politics</a>
</p>
</div>
</div>

<div id="outline-container-orgb023c63" class="outline-3">
<h3 id="orgb023c63"><a href="./posts/blog-org-mode-pt-2.html">Blogging with Org Mode: An Update</a></h3>
<div class="outline-text-3" id="text-orgb023c63">
<p>
  <b><b>Saturday, August 22, 2020</b></b> <br>
In my <a href="./posts/blogging-with-org-mode.html">last post</a>, I went over how I set up this blog solely in org-mode. And since that post has been published, I've made a few more changes to the configuration and so, in an effort to provide the most up to date information, I figured I'd write a little addendum.
  <a href="./posts/blog-org-mode-pt-2.html">Read more&#x2026;</a><br>
  <a href="./tags/dev.html">dev</a>
</p>
</div>
</div>

<div id="outline-container-org160c496" class="outline-3">
<h3 id="org160c496"><a href="./posts/blogging-with-org-mode.html">How I built a simple static blog with org-mode</a> || 08/11/20 Tue</h3>
<div class="outline-text-3" id="text-org160c496">
<p>
<i><a href="./tags/dev.html">dev</a></i>
There's always something new to discover with emacs and org-mode, and building a blog was my way of wading into deeper waters - not longer content to just get my feet wet. 
<a href="./posts/blogging-with-org-mode.html">Read more&#x2026;</a><br>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
